--Лабораторна робота №1
--студентки групи КН-31 
--підгрупа 2
--Ясинського Дениса
--варіант №11

--Мета:Ознайомитись з основними типами мови. Ознайомитись зi структурою та
--функцiями Glasgow Haskell Compiller. Набути навичок роботи з iнтерпретатором
--ghci та визначення найпростiших функцiй

-- Завдання 1.11 Наведiть приклади виразiв вказаного типу. Кожен список має мiстити
--кiлька елементiв. Перегляньте тип прикладiв, як їх визначає ghci. Прокоментуйте.
--[([Char],[Integer])]

--[(['s', 'a'], [2, 24])]
--[(['b'], [3, 8, 16])]
--[(['a', 'b', 'z'], [1])]

import Data.List ()
import System.IO

--Завдання 2.11 Функцiя визначає, чи мiстить круг початок координат. 
--Круг задається координатами центра та радiусом

--Вирішення: для цього нам потрібно визначити чи відстань
--від початку координат до центру круга є меншою за радіус.
f1 :: (Double, Double, Double) -> Bool
f1 (x, y, r)
 | (sqrt(x*x + y*y) <= r) = True 
 | otherwise = False

f2 :: Double -> Double -> Double -> Bool
f2 x y r
 | (sqrt(x*x + y*y) <= r) = True 
 | otherwise = False

--Тести:
--ghci> f2 3 4 6  ->  True
--ghci> f1 (3, 4, 4) -> False

 --Висновок: Під час лабораторної роботи я ознайомився з основами
 --мови Haskell, а саме: зі створенням функцій, їх тестуванням,
 --та з типами мови Haskell.